In [1]:
import pandas as pd
import numpy as np
from pymove.core.PandasMoveDataFrame import PandasMoveDataFrame

In [2]:
df = pd.read_csv('examples/geolife_sample.csv', parse_dates=['datetime'])
df.head()

         lat         lon            datetime  id
0  39.984094  116.319236 2008-10-23 05:53:05   1
1  39.984198  116.319322 2008-10-23 05:53:06   1
2  39.984224  116.319402 2008-10-23 05:53:11   1
3  39.984211  116.319389 2008-10-23 05:53:16   1
4  39.984217  116.319422 2008-10-23 05:53:21   1

In [3]:
move_df = PandasMoveDataFrame(data=df, latitude="lat", longitude="lon", datetime="datetime")

In [ ]:
move_df.get_users_number()

In [ ]:
move_df.to_numpy()

In [ ]:
move_df.write_file("teste.csv")

In [ ]:
move_df.len()

In [ ]:
move_df.to_dict()

In [ ]:
move_df.to_grid(8)

In [ ]:
move_df.get_bbox()

In [ ]:
move_df.generate_tid_based_on_id_datatime()

In [ ]:
move_df.generate_date_features()

In [ ]:
move_df.generate_hour_features()

In [ ]:
move_df.generate_day_of_the_week_features()

In [ ]:
move_df.generate_time_of_day_features()

In [ ]:
move_df.generate_dist_features()

In [ ]:
move_df.generate_dist_time_speed_features()

In [ ]:
move_df.generate_move_and_stop_by_radius()

In [ ]:
move_df.time_interval()

In [ ]:
move_df.plot_all_features()

In [ ]:
move_df.plot_trajs()

In [ ]:
move_df.plot_traj_id("12008102305")

In [ ]:
move_df.show_trajectories_info()

## Novas funções

In [ ]:
move_df.max()

In [ ]:
move_df.reset_index().head()

In [ ]:
move_df.plot(x='lat', y='lon')

In [ ]:
move_df.select_dtypes(include=['float64']).head()

In [ ]:
move_df.sort_values(by="datetime").head()

In [ ]:
move_df.set_index(keys=["datetime"]).head()

In [ ]:
novo = move_df.drop(columns=["lat"])

In [ ]:
novo.head()

In [ ]:
move_df.shift().head()

In [ ]:
move_df.dropna().head()

In [ ]:
move_df.append(move_df._data.loc[0])

In [ ]:
a =move_df.to_csv()

In [4]:
move_df.min()

lat                     22.1476
lon                     113.549
datetime    2008-10-23 05:53:05
id                            1
dtype: object

In [6]:
move_df.count()

lat         217653
lon         217653
datetime    217653
id          217653
dtype: int64

In [35]:
move_df.groupby("lat").mean().head()

                  lon   id
lat
22.147577  113.563006  5.0
22.147735  113.563021  5.0
22.147797  113.563177  5.0
22.147807  113.563166  5.0
22.147941  113.563253  5.0

In [22]:
move_df.drop_duplicates().head()

         lat         lon            datetime  id
0  39.984094  116.319236 2008-10-23 05:53:05   1
1  39.984198  116.319322 2008-10-23 05:53:06   1
2  39.984224  116.319402 2008-10-23 05:53:11   1
3  39.984211  116.319389 2008-10-23 05:53:16   1
4  39.984217  116.319422 2008-10-23 05:53:21   1

In [25]:
move_df.astype({"lat":'float64'}).head()

         lat         lon            datetime  id
0  39.984094  116.319236 2008-10-23 05:53:05   1
1  39.984198  116.319322 2008-10-23 05:53:06   1
2  39.984224  116.319402 2008-10-23 05:53:11   1
3  39.984211  116.319389 2008-10-23 05:53:16   1
4  39.984217  116.319422 2008-10-23 05:53:21   1

In [38]:
move_df.duplicated().head()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [39]:
move_df.any()

lat         True
lon         True
datetime    True
id          True
dtype: bool

In [43]:
move_df.isin([39.984094]).head()

     lat    lon  datetime     id
0   True  False     False  False
1  False  False     False  False
2  False  False     False  False
3  False  False     False  False
4  False  False     False  False

In [44]:
move_df.nunique()

lat          61615
lon          58393
datetime    215808
id               2
dtype: int64

In [ ]:
move_df.